mattivilola/ilo-esp32-waveshare-app/firmware/sdkconfig.defaults
# ESP32-S3-WROOM-1-N16R8 on Waveshare ESP32-S3-Touch-LCD-5B (SKU 28151)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 8 MB OPI PSRAM and RGB framebuffer bandwidth
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Keep executable code and read-only data in flash. PSRAM is reserved for
# framebuffers and heap; XIP is unnecessary and less robust during bring-up.
# CONFIG_SPIRAM_XIP_FROM_PSRAM is not set
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS is not set
# CONFIG_SPIRAM_RODATA is not set
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# Native USB serial/JTAG is the verified development path on this board
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Board, GT911, and initial LVGL object creation all run synchronously in app_main.
# Reserve enough internal stack for that one-time initialization path.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# TLS-PSK is the only wireless application transport in protocol v1
CONFIG_ESP_TLS_PSK_VERIFICATION=y

# UI assets used by the compact operations console
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_USE_LOG=y

# Dual OTA slots and first-boot validation provide rollback safety. Signed OTA
# verification is intentionally enabled only in the separate release profile;
# normal development builds have no OTA install ingress.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
